# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'
tap 'elastic/tap'

# Binaries
brew 'awscli'
brew 'artillery'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'fzf' # Fuzzy file/history search
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'helm'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'kubernetes-cli'
brew 'ngrok'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'sshuttle'
brew 'stripe/stripe-cli/stripe'
brew 'svn' # Needed to install fonts
brew 'doctl'
brew 'wget'
brew 'thefuck'
brew 'fluxcd/tap/flux'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'go'
brew 'elastic/tap/elasticsearch-full'

# Apps
cask '1password'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'github'
cask 'google-chrome'
cask 'iterm2'
cask 'mimestream'
cask 'obsidian'
cask 'phpmon'
cask 'phpstorm'
cask 'ray'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'tinkerwell'
cask 'transmit'
cask 'tuple'
cask 'visual-studio-code'
cask 'google-cloud-sdk'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlstephen'
cask 'quicklook-csv'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-ibm-plex-mono'
